
//----------------------------------------------------------------------
// @filename ModeDebug.cpp
// @author: saito ko
// @explanation
// ゲーム本編を管理するクラス
//----------------------------------------------------------------------
#include "../../Header/Mode/ModeDebug.h"

//----------------------------------------------------------------------
// @brief 初期化処理
// @return 無し
//----------------------------------------------------------------------
bool ModeDebug::Initialize() {
	if (!base::Initialize()) { return false; }
	return true;
}
//----------------------------------------------------------------------
// @brief 終了処理
// @return 成功しているか
//----------------------------------------------------------------------
bool ModeDebug::Terminate() {
	base::Terminate();
	return true;
}
//----------------------------------------------------------------------
// @brief 更新処理
// @return 成功したかどうか
//----------------------------------------------------------------------
bool ModeDebug::Process() {
	base::Process();
	return true;
}
//----------------------------------------------------------------------
// @brief 描画処理
// @return 成功したかどうか
//----------------------------------------------------------------------
bool ModeDebug::Render() {
	base::Render();
	return true;
}
