//----------------------------------------------------------------------
// @filename SplineBox.h
// @author: Saito Ko
// @explanation
// スプラインの軌道に配置するオブジェクトのクラス
//----------------------------------------------------------------------
#include "../Header/SplineBox.h"

//----------------------------------------------------------------------
// @brief コンストラクタ
// @return なし
//----------------------------------------------------------------------
SplineBox::SplineBox() : ObjectBase("Spline") {
	_pos = Vector3D(rand() % 1000 - 500, rand() % 1000 - 500, rand() % 1000 - 500);
	obb = new OBB("Spline",_pos,this);
	obb->SetLength(Vector3D(1, 1, 1) * 50);
};

//----------------------------------------------------------------------
// @brief コンストラクタ
// @param pos 位置
// @return なし
//----------------------------------------------------------------------
SplineBox::SplineBox(Vector3D pos) : ObjectBase("Spline") {
	_pos = pos;
	obb = new OBB("Spline",_pos,this);
	obb->SetLength(Vector3D(1,1,1)*50);
};

//----------------------------------------------------------------------
// @brief デストラクタ
// @return なし
//----------------------------------------------------------------------
SplineBox::~SplineBox(){
	delete obb;
};

//----------------------------------------------------------------------
// @brief 更新
// @return 成功したかどうか
//----------------------------------------------------------------------
bool SplineBox::Update(){
	obb->Update(_pos);
	return true;
}