//----------------------------------------------------------------------
// @filename Player.cpp
// @author: Fukuma Kyohei
// @explanation
// プレイヤークラス
// プレイヤーの処理全般クラス
//----------------------------------------------------------------------
#include "../../../Header/Character/Player/Player.h"
#include "appframe.h"

//----------------------------------------------------------------------
// @brief コンストラクタ
// @return なし
//----------------------------------------------------------------------
Player::Player(ModeBase* game) :CharacterBase(game){
	m_Pos = { 0.0f,200.0f,0.0f };
	m_UseGravity = true;

	m_Collision = NEW Sphere();
	m_Collision->r = 100.0f;
	m_Sphere = NEW DrawSphereComponent(this);

	SphereColComponent* Col = NEW SphereColComponent(this);

	//カメラ初期化
	m_Camera = NEW CameraComponent(this);
}

//----------------------------------------------------------------------
// @brief デストラクタ
// @return なし
//----------------------------------------------------------------------
Player::~Player(){
	delete m_Collision;
	m_Collision = nullptr;
	delete m_Camera;
	m_Camera = nullptr;
}

//----------------------------------------------------------------------
// @brief 更新処理
// @return なし
//----------------------------------------------------------------------
void Player::Process(){
	CharacterBase::Process();
////////////////////////////////////////////////////////////////////////
//移動処理
////////////////////////////////////////////////////////////////////////
	m_Sphere->SetSphere(m_Collision);
}

//----------------------------------------------------------------------
// @brief 描画処理
// @return なし
//----------------------------------------------------------------------
void Player::Render(){
	CharacterBase::Render();
}

//----------------------------------------------------------------------
// @brief デバッグ表示
// @return なし
//----------------------------------------------------------------------
void Player::Debug(){
}
