//----------------------------------------------------------------------
// @filename Character.cpp
// @author: Fukuma Kyohei
// @explanation
// オブジェクトの派生クラス
// プレイヤーや敵クラスはここから派生する
//----------------------------------------------------------------------
#include "../../Header/Character/CharacterBase.h"

//----------------------------------------------------------------------
// @brief コンストラクタ
// @return なし
//----------------------------------------------------------------------
CharacterBase::CharacterBase(ModeBase* game) : ObjectBase(game){
	m_Handle	 = -1;
	m_Hp		 = 0;
	m_LineSeg	 = 0.0f;
	m_UseGravity = false;
}

//----------------------------------------------------------------------
// @brief デストラクタ
// @return なし
//----------------------------------------------------------------------
CharacterBase::~CharacterBase(){
}

//----------------------------------------------------------------------
// @brief 更新処理
// @return なし
//----------------------------------------------------------------------
void CharacterBase::Process(){
	ObjectBase::Process();
	//重力に干渉する場合
	if (m_UseGravity){
		//y座標を重力値で減算し続ける
		m_Pos.y -= GRAVITY_VALUE;
		//規定値まで落ちたらそこでy座標を固定する
		if (m_Pos.y <= 0.0f) { m_Pos.y = 0.0f; }
	}
	
}

//----------------------------------------------------------------------
// @brief 描画処理
// @return なし
//----------------------------------------------------------------------
void CharacterBase::Render(){
	ObjectBase::Render();
}

//----------------------------------------------------------------------
// @brief デバッグ表示
// @return なし
//----------------------------------------------------------------------
void CharacterBase::Debug(){
}

