//----------------------------------------------------------------------
// @filename Timer.cpp
// @author: Saito Ko
// @explanation
// 物理演算で使用する処理にかかった時間を計測するクラス
//----------------------------------------------------------------------
#include "../../Header/Function/Timer.h"
Timer* Timer::_instance= nullptr;

//----------------------------------------------------------------------
// @brief コンストラクタ
// @return 無し
//----------------------------------------------------------------------
Timer::Timer() {
	_instance = this;
	_lastTime = 0;
	_elapsedTime = 0.0f;
}

//----------------------------------------------------------------------
// @brief デストラクタ
// @return 無し
//----------------------------------------------------------------------
Timer::~Timer() {
	_instance = nullptr;
}

//----------------------------------------------------------------------
// @brief タイマーをスタート
// @return 成功したかどうか
//----------------------------------------------------------------------
bool Timer::Start() {
	_lastTime = GetNowHiPerformanceCount();
	return true;
}

//----------------------------------------------------------------------
// @brief 前のフレームからの経過時間を計算
// @return 経過時間
//----------------------------------------------------------------------
double Timer::TimeElapsed() {
	LONGLONG _nowTime = GetNowHiPerformanceCount();
	int _interval = (int)(_nowTime - _lastTime);
	_elapsedTime = (double)_interval / 1000000;
	_lastTime = _nowTime;
	return _elapsedTime;//前フレームからの経過時間を返す
}